import numpy as np

file_path = "경로"

data = np.load(file_path)

print(f"Keys : {data.files}")

for key in data.files:
    arr = data[key]
    print(f"\n===== {key} =====")
    print("Shape:", arr.shape)
    print("Dtype:", arr.dtype)

    # 데이터가 크면 앞부분만 보여줌
    print("Data sample:", arr[:5] if arr.ndim > 0 else arr)
    
# train.npz 파일
# Keys : ['x', 'y']

# ===== x =====
# Shape: (6144000, 4096)
# Dtype: uint8
# Data sample: [[  0   0   0 ...   0   0   0]
#  [  0   1   0 ... 128  83   1]
#  [243  71 101 ... 242  81 235]
#  [255 255 255 ... 255 255 255]
#  [ 32  32  32 ...  32  32  32]]

# ===== y =====
# Shape: (6144000,)
# Dtype: uint8
# Data sample: [ 0 72 10 14 19]

# 총 6,144,000개의 샘플이 있음, 각 샘플은 4,096byte 구성.
# ==================================================================
# # test.npz 파일
# Keys : ['x', 'y']

# ===== x =====
# Shape: (768000, 4096)
# Dtype: uint8
# Data sample: [[196  92  12 ...  59  59  68]
#  [240  52 165 ...  89 103  61]
#  [ 47  50  48 ... 112 115  58]
#  [ 85 198 103 ... 105  33   9]
#  [ 29  31 154 ... 140  34 187]]

# ===== y =====
# Shape: (768000,)
# Dtype: uint8
# Data sample: [21 38 63 10 52]

# 총 768,000개의 샘플이 있음, 각 샘플은 4,096byte 구성.
# ==================================================================

# # val.npz 파일
# Keys : ['x', 'y']

# ===== x =====
# Shape: (768000, 4096)
# Dtype: uint8
# Data sample: [[124 127 123 ... 191  14 133]
#  [ 49 100 100 ...  48  50  51]
#  [205 151 249 ... 123 172  64]
#  [240  24 237 ... 162 134  87]
#  [161 167 149 ... 148 147 149]]

# ===== y =====
# Shape: (768000,)
# Dtype: uint8
# Data sample: [ 2 57 65 33 19]

# 총 768,000개의 샘플이 있음, 각 샘플은 4,096byte 구성.
# ==================================================================